RANS/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default        Euler;
}



gradSchemes
{
    default         cellLimited Gauss linear 1;
}

divSchemes
{
    default          none;
    div(phi,U)       Gauss linearUpwind grad(U); 
    div(phi,k)       Gauss upwind;
     div(phi,epsilon)     Gauss upwind;
 //   div(phi,nuTilda) Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;

}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

    //  wallDist
    // {
   //  method          meshWave;

    // Optionally correct distance from near-wall cells to the // boundary
   // correctWalls    true;
 //    }
//method Poisson;

        // Optional entry enabling the calculation
        // of the normal-to-wall field
        //nRequired false;

// ************************************************************************* //

